{
  "projects" : [
    {
      "title": "SurfBored",
      "date": "2024",
      "description": "Mobile App",
      "content": [
        "Need something to do today? Create boards with your favorite activities! Or better yet, find someone else's board to find something new.",
        "Have trouble choosing? SurfBored's shuffle feature will pick activities at random so you dont have to.",
        "Search for tags to find new activites you'll love!"
      ],
      "linktitle": "Repository Link",
      "link": "https://www.surfbored.app",
      "tag": "App",
      "skills": [
        {
          "title": "Flutter",
          "icon": "vscode-icons:file-type-flutter"
        },
        {
          "title": "Bloc",
          "icon": "file-icons:cubit"
        },
        {
          "title": "Firebase",
          "icon": "vscode-icons:file-type-firebase"
        },
        {
          "title": "Algolia",
          "icon": "la:algolia"
        }
      ]
    },
    {
      "title": "PerfectLine",
      "date": "2024",
      "description": "Online Courses and Remote Lessons",
      "content": [
        "Rebuilding CodeSantaCruz has streamlined my teaching, allowing me to manage my time more effectively. The updated site helps students follow along during lessons and continue their work independently, pushing their creative limits.",
        "This project was both practical and enjoyable, incorporating everything I love about web and game development, C++, and teaching. I chose Astro for its speed in serving static content and TailwindCSS for a modern frontend design.",
        "To further assist my teaching environment, I created a linux shell server to allow studnets to create, write, and excetute their own files via an online server. This allowed them to put all the files we created in the lessons in one central place."
      ],
      "linktitle": "perfectline.io",
      "link": "https://perfectline.io/",
      "tag": "Website",
      "skills": [
        {
          "title": "Astro",
          "icon": "vscode-icons:file-type-astro"
        },
        {
          "title": "Tailwindcss",
          "icon": "vscode-icons:file-type-tailwind"
        },
        {
          "title": "Git",
          "icon": "vscode-icons:file-type-git"
        },
        {
          "title": "Linux",
          "icon": "flat-color-icons:linux"
        }
      ]
    },
    {
      "title": "CodeSantaCruz",
      "date": "2022",
      "description": "In Person And Remote Lessons",
      "content": [
        "CodeSantaCruz was my first large-scale, practical project where I offered a software development teaching service both remotely and in person. The website was a great stepping stone for a first live webpage and I gained lots of experience with web development. It is here that I also learned the downsides and hassle of over-engineering."
      ],
      "linktitle": "Repository Link",
      "link": "https://github.com/ethanokamura/CodeSantaCruz",
      "tag": "Website",
      "skills": [
        {
          "title": "React",
          "icon": "vscode-icons:file-type-reactjs"
        },
        {
          "title": "Tailwindcss",
          "icon": "vscode-icons:file-type-tailwind"
        },
        {
          "title": "Git",
          "icon": "vscode-icons:file-type-git"
        }
      ]
    },
    {
      "title": "Game Development",
      "date": "2010",
      "description": "Fundamentals of Game Development",
      "content": [
        "Since the age of 9, I've been immersed in the world of video game development, using it as a creative outlet to bring my artwork to life and craft experiences I would enjoy. This journey sparked my love for software development. Over the past 13 years, primarily working with Unity, I've honed my skills in perseverance, mastering a development lifecycle that suits me, and overcoming obstacles.",
        "As I've grown, my focus has shifted from building new games to testing and optimizing older projects. This evolution has deepened my understanding of software performance and refinement, making game development not just a hobby, but a passion that continues to drive my career forward."
      ],
      "skills": [
        {
          "title": "Unity",
          "icon": "mdi:unity"
        },
        {
          "title": "Firebase",
          "icon": "vscode-icons:file-type-firebase"
        }
      ]
    }
  ],
  "skills":
  [
    {
      "title": "C++",
      "icon": "vscode-icons:file-type-cpp3",
      "level": 9
    },
    {
      "title": "C#",
      "icon": "vscode-icons:file-type-csharp2",
      "level": 6
    },
    {
      "title": "C",
      "icon": "vscode-icons:file-type-c3",
      "level": 5
    },
    {
      "title": "Python",
      "icon": "vscode-icons:file-type-python",
      "level": 3
    },
    {
      "title": "Dart",
      "icon": "vscode-icons:file-type-dartlang",
      "level": 7
    },
    {
      "title": "JavaScript",
      "icon": "vscode-icons:file-type-js",
      "level": 4
    },
    {
      "title": "TypeScript",
      "icon": "vscode-icons:file-type-typescript",
      "level": 4
    },
    {
      "title": "HTML",
      "icon": "vscode-icons:file-type-html",
      "level": 10
    },
    {
      "title": "CSS",
      "icon": "vscode-icons:file-type-css",
      "level": 10
    },
    {
      "title": "Bash",
      "icon": "codicon:terminal-bash",
      "level": 8
    }
  ],
  "jobs": [
    {
      "title": "PerfectLine",
      "icon": "ph:code-bold",
      "position": "Teacher and Founder",
      "date": "Current",
      "desc": "Offered an efficient remote software development teaching service that includes digital curriculum accessible by current students. The site held both documentation and video lessons. Gained experience in full-stack web development, working with digital media, and handling content heavy pages, all while solidifying my knowledge on computer science topics."
    },
    {
      "title": "CodeSantaCruz",
      "icon": "ph:code-bold",
      "position": "Teacher and Founder",
      "date": "2022-2024",
      "desc": "Offered both a remote and in-person software development teaching service. Gained experience in working with others, managing a schedule, and static web development, all while solidifying my knowledge on computer science topics."
    },
    {
      "title": "The Coder School",
      "icon": "ph:code-bold",
      "position": "Teacher",
      "date": "2022",
      "desc": "Worked with over 50 students teaching various languages and concepts ranging from game development, general computer science topics, and web design. Gained experience managing a group of people and working on a team to create an efficient, easily understood, in-depth curriculum."
    },
    {
      "title": "New Leaf Community Market",
      "icon": "ic:outline-local-grocery-store",
      "position": "Sales Associate",
      "date": "2021",
      "desc": "Worked efficiently with a team and provided excellent customer service as a cashier in a high-end grocery store environment, demonstrating strong attention to detail and accuracy in handling financial transactions."
    },
    {
      "title": "Back Nine Bar and Grill",
      "icon": "mdi:food-outline",
      "position": "Server",
      "date": "2021",
      "desc": "Delivered a professional dining experience to local patrons. Gained experience working in a fine-dining establishment, delivering exceptional customer experiences through polished communication, working overtime, attention to detail, and management of time and stress in a fast-paced environment. Demonstrated proficiency in managing multiple tables and large business meetings while ensuring a seamless dining experience for patrons."
    },
    {
      "title": "Woodstocks Pizza",
      "icon": "uil:food",
      "position": "Delivery Driver / Kitchen Assistance",
      "date": "2020",
      "desc": "Served as a diligent busser and delivery driver for a pizza establishment, contributing to the seamless flow of restaurant operations and ensuring timely and accurate deliveries. Maintained a focus on customer satisfaction through efficient service and attention to detail."
    },
    {
      "title": "Cinelux Theaters",
      "icon": "tabler:movie",
      "position": "Floor Staff",
      "date": "2017-2020",
      "desc": "Experienced a diverse range of responsibilities during a three-year tenure at a movie theater, encompassing roles in concessions, café operations, and general maintenance. Consistently upheld high standards of customer service, operational efficiency, and facility upkeep in a dynamic entertainment environment. We aimed to create a professional, organized, and relaxing environment for our patrons."
    },
    {
      "title": "Lucky Bee Press",
      "icon": "clarity:design-line",
      "position": "Associate",
      "date": "2013-2020",
      "desc": "Assisted in stocking inventory, monitoring quality control, and gained experience working for a small business. This was my first look at owning and managing your own business, which proved to be extremely beneficial."
    }
  ]
}
