{
  "projects" : [
    {
      "title": "CodeSantaCruz Linux Server",
      "date": "2024",
      "description": "Online Courses and Remote Lessons",
      "content": "To further assist my teaching environment, I created a linux shell server to allow studnets to create, write, and excetute their own files via an online server. This allowed them to put all the files we created in the lessons in one central place. These files were accessable 24/7 and allowed me to grade and edit files with ease. This exponentially increased my efficency and ability to create a cleaner, more efficient learning environment for both my students and myself This gave me experience working with servers, linux, bash scripting, IT best practices, and cyber security.",
      "tag": "community"
    },
    {
      "title": "PerfectLine (CodeSantaCruz Rework)",
      "date": "2024",
      "description": "Online Courses and Remote Lessons",
      "content": "I decided after having more experience under my belt, that it was time to improve CodeSantaCruz as a whole. The new version is a necessary evolution / rework of my previous website and way of teaching with CodeSantaCruz. With the rework, I offer a remote software development teaching service that includes digital curriculum accessible by current students. This includes both documentation and video lessons. The new website is used when I work with my students so they can follow along and see what is coming next. It allows my students to continue to work on their own and push their creative limits beyond our scheduled lessons. Rebuilding CodeSantaCruz allowed for a signifigantly more effective solution to my problems with CodeSantaCruz. Being a full-time student, dev, and active member in my community, I found myself being pulled in all directions. This now allowed me to take on less scheduled lessons and instead instruct my students, assign curriculum, and check progress in a more efficient manner. For me, this was a success. This project was not only fun to create, but extremely practical. I was able to include everything I love about web development, game development, working with C++ and teaching the promising future leaders in my community. With more experience in choosing frontend frameworks, I chose to use Astro this time around. It is blazingly fast at serving static content in high quanity. Not only this, but reworking the website allowed me to present a much more modern, frictionless frontend design using Tailwindcss.",
      "link": "https://perfectline.io/",
      "tag": "Website"
    },
    {
      "title": "CodeSantaCruz",
      "date": "2022",
      "description": "In Person And Remote Lessons",
      "content": "CodeSantaCruz was my first large-scale, practical project where I offered a software development teaching service both remotely and in person. For this project, I created a static site using the UI libraries React (a JavaScript framework) and Tailwindcss (a CSS framework). The website was a great stepping stone for a first live webpage and I gained lots of experience with web development. It is here that I also learned the downsides and hassle of over-engineering.",
      "link": "https://perfectline.io/",
      "tag": "Website"
    }
  ],
  "skills":
  [
    {
      "title": "C++",
      "icon": "vscode-icons:file-type-cpp3"
    },
    {
      "title": "C#",
      "icon": "vscode-icons:file-type-csharp2"
    },
    {
      "title": "Unity",
      "icon": "mdi:unity"
    },
    {
      "title": "Photoshop",
      "icon": "vscode-icons:file-type-photoshop"
    },
    {
      "title": "JavaScript",
      "icon": "vscode-icons:file-type-js"
    },
    {
      "title": "TypeScript",
      "icon": "vscode-icons:file-type-typescript-official"
    },
    {
      "title": "Astro",
      "icon": "vscode-icons:file-type-astro"
    },
    {
      "title": "SvelteKit",
      "icon": "vscode-icons:file-type-svelte"
    },
    {
      "title": "CSS",
      "icon": "vscode-icons:file-type-css"
    },
    {
      "title": "Tailwindcss",
      "description": "description",
      "icon": "vscode-icons:file-type-tailwind"
    },
    {
      "title": "HTML",
      "icon": "vscode-icons:file-type-html"
    },
    {
      "title": "Firebase",
      "icon": "vscode-icons:file-type-firebase"
    },
    {
      "title": "Git",
      "icon": "vscode-icons:file-type-git"
    },
    {
      "title": "Linux",
      "icon": "flat-color-icons:linux"
    },
    {
      "title": "Bash",
      "icon": "codicon:terminal-bash"
    },
    {
      "title": "Flutter",
      "icon": "vscode-icons:file-type-flutter"
    }
  ],
  "jobs": [
    {
      "title": "PerfectLine",
      "icon": "ph:code-bold",
      "position": "Teacher and Founder",
      "date": "Current",
      "desc": "Offered an efficient remote software development teaching service that includes digital curriculum accessible by current students. The site held both documentation and video lessons. Gained experience in full-stack web development, working with digital media, and handling content heavy pages, all while solidifying my knowledge on computer science topics."
    },
    {
      "title": "CodeSantaCruz",
      "icon": "ph:code-bold",
      "position": "Teacher and Founder",
      "date": "2022-2024",
      "desc": "Offered both a remote and in-person software development teaching service. Gained experience in working with others, managing a schedule, and static web development, all while solidifying my knowledge on computer science topics."
    },
    {
      "title": "The Coder School",
      "icon": "ph:code-bold",
      "position": "Teacher",
      "date": "2022",
      "desc": "Worked with over 50 students teaching various languages and concepts ranging from game development, general computer science topics, and web design. Gained experience managing a group of people and working on a team to create an efficient, easily understood, in-depth curriculum."
    },
    {
      "title": "New Leaf Community Market",
      "icon": "ic:outline-local-grocery-store",
      "position": "Sales Associate",
      "date": "2021",
      "desc": "Worked efficiently with a team and provided excellent customer service as a cashier in a high-end grocery store environment, demonstrating strong attention to detail and accuracy in handling financial transactions."
    },
    {
      "title": "Back Nine Bar and Grill",
      "icon": "mdi:food-outline",
      "position": "Server",
      "date": "2021",
      "desc": "Delivered a professional dining experience to local patrons. Gained experience working in a fine-dining establishment, delivering exceptional customer experiences through polished communication, working overtime, attention to detail, and management of time and stress in a fast-paced environment. Demonstrated proficiency in managing multiple tables and large business meetings while ensuring a seamless dining experience for patrons."
    },
    {
      "title": "Woodstocks Pizza",
      "icon": "uil:food",
      "position": "Delivery Driver / Kitchen Assistance",
      "date": "2020",
      "desc": "Served as a diligent busser and delivery driver for a pizza establishment, contributing to the seamless flow of restaurant operations and ensuring timely and accurate deliveries. Maintained a focus on customer satisfaction through efficient service and attention to detail."
    },
    {
      "title": "Cinelux Theaters",
      "icon": "tabler:movie",
      "position": "Floor Staff",
      "date": "2017-2020",
      "desc": "Experienced a diverse range of responsibilities during a three-year tenure at a movie theater, encompassing roles in concessions, café operations, and general maintenance. Consistently upheld high standards of customer service, operational efficiency, and facility upkeep in a dynamic entertainment environment. We aimed to create a professional, organized, and relaxing environment for our patrons."
    },
    {
      "title": "Lucky Bee Press",
      "icon": "clarity:design-line",
      "position": "Associate",
      "date": "2013-2020",
      "desc": "Assisted in stocking inventory, monitoring quality control, and gained experience working for a small business. This was my first look at owning and managing your own business, which proved to be extremely beneficial."
    }
  ]
}