{
  "projects" : [
    {
      "title": "KōDo",
      "date": "2024",
      "description": "Online Courses and Remote Lessons",
      "content": "KōDo is an evolution / rework of my previous company, CodeSantaCruz. With KōDo I offer a remote software development teaching service that includes digital curriculum accessible by current students. This includes both documentation and video lessons. The KōDo website is used when I work with my students so they can follow along and see what is coming next. It allows my students to continue to work on their own and push their creative limits beyond our scheduled lessons. KōDo was the clear efficient solution to my problems with CodeSantaCruz. Being a full-time student, dev, and active member in my community, I found myself being pulled in all directions. KōDo allowed me to take on less scheduled lessons and instead instruct my students, assign curriculum, and check progress in a more efficient manner. For me, this was a success. This project was not only fun to create, but extremely practical. I was able to include everything I love about web development, game development, working with C++ and teaching the promising future leaders in my community.",
      "link": "/",
      "tag": "community"
    },
    {
      "title": "CodeSantaCruz",
      "date": "2022",
      "description": "In Person And Remote Lessons",
      "content": "CodeSantaCruz was my first large-scale, practical project where I offered a software development teaching service both remotely and in person. For this project, I created a static site using the UI libraries React (a JavaScript framework) and Tailwindcss (a CSS framework). The website was a great stepping stone for a first live webpage and I gained lots of experience with web development. It is here that I also learned the downsides and hassle of over-engineering.",
      "link": "https://codesantacruz.com/",
      "tag": "community"
    },
    {
      "title": "Game",
      "date": "2024",
      "description": "Video Game",
      "content": "Ever since I was a child, I wanted to know how video games worked. Because of this interest at a young age, I taught myself everything I needed to know about game development. After trying out various software like GameSalad, GameMaker Studio, and Unity, I decided to stick with Unity. Fast-forward a bit, and I have now been working with Unity for over 10 years. Being able to express myself creatively has always been extremely important. Now, with years of experience, I am able to make my dreams come true. In the game, TITLE, you play as a small farmer who must defend his crops from incoming enemies. To make the project more complex, I used the Firebase cloud database to hold all the user's data and display a leaderboard for players. Using my knowledge of both video game and web development, I exported my game as a WebGL file and uploaded it onto a custom website. The game is fully functional and free to play. Feel free to try it out for yourself!",
      "link": "/",
      "tag": "personal"
    },
    {
      "title": "JuiceBox",
      "date": "2024",
      "description": "Clothing Company",
      "content": "JuiceBox was a creative project I dove into in the start of 2024. I collaborated with my good childhood friend Nick Endres to help with marketing for the brand. I have always enjoyed art and skate culture and have, for many years, dreamt of creating my own clothing company. With some of the money I had saved from KōDo and past jobs, I reinvested in myself to start JucieBox.",
      "link": "/",
      "tag": "personal"
    },
    {
      "title": "Portfolio",
      "date": "2024",
      "description": "",
      "content": "Last, but not least, I have my portfolio. It is here where I am able to share some of my life's work. The code itself displays my ever evolving productivity and drive for efficiency. I believe I have created a sleek, simplistic, design while showcasing my ability to work with front-end frameworks such as Tailwindcss and Astro.",
      "link": "/",
      "tag": "portfolio"
    }
  ],
  "skills":
  [
    {
      "title": "C++",
      "icon": "vscode-icons:file-type-cpp3"
    },
    {
      "title": "C#",
      "icon": "vscode-icons:file-type-csharp2"
    },
    {
      "title": "Unity",
      "icon": "mdi:unity"
    },
    {
      "title": "Photoshop",
      "icon": "vscode-icons:file-type-photoshop"
    },
    {
      "title": "JavaScript",
      "icon": "vscode-icons:file-type-js"
    },
    {
      "title": "TypeScript",
      "icon": "vscode-icons:file-type-typescript-official"
    },
    {
      "title": "Astro",
      "icon": "vscode-icons:file-type-astro"
    },
    {
      "title": "SvelteKit",
      "icon": "vscode-icons:file-type-svelte"
    },
    {
      "title": "CSS",
      "icon": "vscode-icons:file-type-css"
    },
    {
      "title": "Tailwindcss",
      "description": "description",
      "icon": "vscode-icons:file-type-tailwind"
    },
    {
      "title": "HTML",
      "icon": "vscode-icons:file-type-html"
    },
    {
      "title": "Firebase",
      "icon": "vscode-icons:file-type-firebase"
    },
    {
      "title": "Git",
      "icon": "vscode-icons:file-type-git"
    }
    
  ],
  "jobs": [
    {
      "title": "KōDo",
      "icon": "ph:code-bold",
      "position": "Teacher and Founder",
      "date": "Current",
      "desc": "Offered an efficient remote software development teaching service that includes digital curriculum accessible by current students. The site held both documentation and video lessons. Gained experience in full-stack web development, working with digital media, and handling content heavy pages, all while solidifying my knowledge on computer science topics."
    },
    {
      "title": "JuiceBox",
      "icon": "tabler:shirt",
      "position": "Creator and Designer",
      "date": "Current",
      "desc": "Produced consistent, high-quality clothing. Gained experience with product marketing, full-stack web development for the website, and a hands-on production process."
    },
    {
      "title": "CodeSantaCruz",
      "icon": "ph:code-bold",
      "position": "Teacher and Founder",
      "date": "2022-2024",
      "desc": "Offered both a remote and in-person software development teaching service. Gained experience in working with others, managing a schedule, and static web development, all while solidifying my knowledge on computer science topics."
    },
    {
      "title": "The Coder School",
      "icon": "ph:code-bold",
      "position": "Teacher",
      "date": "2022",
      "desc": "Worked with over 50 students teaching an array of different languages and concepts ranging from game development, general computer science topics, and web design. Gained experience managing a group of people and working on a team to create efficient, easily understood, in depth curriculum."
    },
    {
      "title": "New Leaf Community Market",
      "icon": "ic:outline-local-grocery-store",
      "position": "Sales Associate",
      "date": "2021",
      "desc": "Worked efficiently with a team and provided excellent customer service as a cashier in a high-end grocery store environment, demonstrating strong attention to detail and accuracy in handling financial transactions."
    },
    {
      "title": "Back Nine Bar and Grill",
      "icon": "mdi:food-outline",
      "position": "Server",
      "date": "2021",
      "desc": "Delivered a professional dining experience to local patrons. Gained experience working in a fine-dining establishment, delivering exceptional customer experiences through polished communication, working overtime, attention to detail, and management of time and stress in a fast-paced environment. Demonstrated proficiency in managing multiple tables and large business meetings while ensuring a seamless dining experience for patrons."
    },
    {
      "title": "Woodstocks Pizza",
      "icon": "uil:food",
      "position": "Delivery Driver / Kitchen Assistance",
      "date": "2020",
      "desc": "Served as a diligent busser and delivery driver for a pizza establishment, contributing to the seamless flow of restaurant operations and ensuring timely and accurate deliveries. Maintained a focus on customer satisfaction through efficient service and attention to detail."
    },
    {
      "title": "Cinelux Theaters",
      "icon": "tabler:movie",
      "position": "Floor Staff",
      "date": "2017-2020",
      "desc": "Experienced a diverse range of responsibilities during a three-year tenure at a movie theater, encompassing roles in concessions, café operations, and general maintenance. Consistently upheld high standards of customer service, operational efficiency, and facility upkeep in a dynamic entertainment environment. We aimed to create a professional, organized, and relaxing environment for our patrons."
    },
    {
      "title": "Lucky Bee Press",
      "icon": "clarity:design-line",
      "position": "Associate",
      "date": "2013-2020",
      "desc": "Assisted in stocking inventory, monitoring quality control, and gained experience working for a small business. This was my first look at owning and managing your own business, which proved to be extremely beneficial."
    }
  ]
}